<img src="https://pandas.pydata.org/static/img/pandas.svg" width="250">

## <center> Intro to Dataframes

In [1]:
import pandas as pd

In [6]:
scores = {
    'name':['Ray', 'Richard', 'Vivian'],
    'city':['New York', 'Singapore', 'Yangon'],
    'score': [75, 99, 92],
}

In [7]:
df = pd.DataFrame(scores)

In [8]:
df.head()

      name       city  score
0      Ray   New York     75
1  Richard  Singapore     99
2   Vivian     Yangon     92

In [9]:
df['name']

0        Ray
1    Richard
2     Vivian
Name: name, dtype: object

In [10]:
df['name_city'] = df['name'] + '_' + df['city']

df.head()

      name       city  score          name_city
0      Ray   New York     75       Ray_New York
1  Richard  Singapore     99  Richard_Singapore
2   Vivian     Yangon     92      Vivian_Yangon

In [11]:
df[df['score'] > 90]

      name       city  score          name_city
1  Richard  Singapore     99  Richard_Singapore
2   Vivian     Yangon     92      Vivian_Yangon